###############################################################################
# Created by write_sdc
###############################################################################
current_design expmob1
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {inputs[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {outputs[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {outputs[0]}]
set_load -pin_load 0.0334 [get_ports {outputs[1]}]
set_load -pin_load 0.0334 [get_ports {outputs[2]}]
set_load -pin_load 0.0334 [get_ports {outputs[3]}]
set_load -pin_load 0.0334 [get_ports {outputs[4]}]
set_load -pin_load 0.0334 [get_ports {outputs[5]}]
set_load -pin_load 0.0334 [get_ports {outputs[6]}]
set_load -pin_load 0.0334 [get_ports {outputs[7]}]
set_load -pin_load 0.0334 [get_ports {outputs[8]}]
set_load -pin_load 0.0334 [get_ports {outputs[9]}]
set_load -pin_load 0.0334 [get_ports {outputs[10]}]
set_load -pin_load 0.0334 [get_ports {outputs[11]}]
set_load -pin_load 0.0334 [get_ports {outputs[12]}]
set_load -pin_load 0.0334 [get_ports {outputs[13]}]
set_load -pin_load 0.0334 [get_ports {outputs[14]}]
set_load -pin_load 0.0334 [get_ports {outputs[15]}]
set_load -pin_load 0.0334 [get_ports {outputs[16]}]
set_load -pin_load 0.0334 [get_ports {outputs[17]}]
set_load -pin_load 0.0334 [get_ports {outputs[18]}]
set_load -pin_load 0.0334 [get_ports {outputs[19]}]
set_load -pin_load 0.0334 [get_ports {outputs[20]}]
set_load -pin_load 0.0334 [get_ports {outputs[21]}]
set_load -pin_load 0.0334 [get_ports {outputs[22]}]
set_load -pin_load 0.0334 [get_ports {outputs[23]}]
set_load -pin_load 0.0334 [get_ports {outputs[24]}]
set_load -pin_load 0.0334 [get_ports {outputs[25]}]
set_load -pin_load 0.0334 [get_ports {outputs[26]}]
set_load -pin_load 0.0334 [get_ports {outputs[27]}]
set_load -pin_load 0.0334 [get_ports {outputs[28]}]
set_load -pin_load 0.0334 [get_ports {outputs[29]}]
set_load -pin_load 0.0334 [get_ports {outputs[30]}]
set_load -pin_load 0.0334 [get_ports {outputs[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {inputs[31]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
