read_verilog -sv rot.v
hierarchy -check -top rot
synth            -top rot
flatten        
hierarchy -top rot
memory
dfflibmap -liberty /home/fjjf/coriolis-2.x/release/install/lib/python3/dist-packages/pdks/ihpsg13g2_c4m/libs.ref/StdCellLib/liberty/StdCellLib_nom.lib
abc       -liberty /home/fjjf/coriolis-2.x/release/install/lib/python3/dist-packages/pdks/ihpsg13g2_c4m/libs.ref/StdCellLib/liberty/StdCellLib_nom.lib
stat
clean
write_blif rot.blif